CRIS67/CoupeDeFrance2019/Programmation/dsPIC/CoupeDeFrance2018.X/main.c
/*
 * File:   main.c
 * Author: Quentin BOYER
 *
 * Created on September 18, 2017, 6:59 PM
 */

#include "constant.h"



#include <xc.h>
#include <math.h>
#include <p33EP512GM310.h>
#include <stdint.h>
#include "clock.h"
#include "GPIO.h"
#include "timer.h"
#include "PWM.h"
#include "QEI.h"
#include "PID.h"
#include "SPI.h"
#include "ADC.h"
#include "UART.h"
#include "interrupt.h"
#include "US.h"
#include "AX12.h"
#include "DMA.h"

void testAccMax();
void reglageDiametre();
void straightPath(double cx, double cy, double ct, double speedMax, double accMax);
void go(double cx, double cy, double speedMax, double accMax);
void goBack(double cx, double cy, double speedMax, double accMax);
void turn(double ct);
void turnNOLIMIT(double ct);

void modif_straightPath(double arg_cx, double arg_cy, double arg_ct, double arg_speedMax, double accMax);

void test();
void test2();
void testPWM();
void testSPI();
void testADC();
void testInterrupt();
void testDelay();

//Global variables
//char TX[TX_SIZE];
char RX[RX_SIZE];
char unsigned TX_i;
char unsigned RX_i;
/*Current position*/
volatile double x;
volatile double y;
volatile double theta;
/*Current setpoint position*/
double xc;
double yc;
double thetac;
/*Final setpoint position*/
double xf;
double yf;
double tf;

uint8_t finalPoint = 1;

volatile PID pidSpeedLeft, pidSpeedRight, pidDistance, pidAngle;
int state = 0;
int R,L;

volatile char arrived;
volatile char arrived_2;

extern volatile char   US_ON[NB_US];
extern volatile char   US_R[NB_US];
extern volatile double US[NB_US];

volatile char sendBT = 0;

extern volatile double receivedX,receivedY,receivedTheta;
extern volatile unsigned char newPosReceived;
extern volatile unsigned char newPosBackReceived;
extern volatile unsigned char newAngleReceived;
extern volatile unsigned char back;

extern volatile unsigned char debugPosRpi;

volatile unsigned char stop = 0;

unsigned char detectUS = 0;
unsigned char sensDetectUS = 1;

extern double var_ACC_MAX;

// <editor-fold defaultstate="collapsed" desc="Génération de trajectoire">
extern unsigned char statePathGeneration;
extern unsigned char stateTrap;

extern double cx, cy, ct;

extern double sign;

extern double phi;
extern double angle;

extern double theta0;
extern double angularVelocity;
extern double prevAngularVelocity;
extern double maxAngularVelocity;

extern double AngularAcceleration;

extern double angle1;


extern double dx;
extern double dy;
extern double alpha;

extern double totalDistance;
extern double dist;

extern double y_0;
extern double x_0;
extern double speed;
extern double precSpeed;

extern double acc;
extern double speedMax;

extern double dist1; // </editor-fold>

extern uint8_t BufferA[8];
extern volatile uint8_t RxDMABuffer[RX_DMA_SIZE];
extern uint16_t start;

extern uint16_t iD2,iF2;

volatile uint8_t verbose = 1;

int main(){
    initClock(); //Clock 140 MHz
    initGPIO();
    initPWM();
    initQEI();
    initDMA();
    initUART();
    initAX12();
    initInt();
    initUS();
    initADC();
    initSPI();
    
    
    x = 0;
    y = 0;
    theta = 0;
    
    xc = 0;
    yc = 0;
    thetac = 0;
    
    xf = 0;
    yf = 0;
    tf = 0;
    
    TX_i = 0;
    RX_i = 0;
    
    R = 0;
    L = 0;
    
    //double i;
    // <editor-fold defaultstate="collapsed" desc="Start">
    /*
     * LED_0 = 1;
    for (i = 0; i < 10000; i++);
    LED_0 = 0;
    for (i = 0; i < 10000; i++);
    LED_0 = 1;
    for (i = 0; i < 10000; i++);
    LED_0 = 0;
    for (i = 0; i < 10000; i++);
    LED_0 = 1;
    for (i = 0; i < 10000; i++);
    LED_0 = 0;
    for (i = 0; i < 10000; i++);
    LED_0 = 1;
    for (i = 0; i < 10000; i++);
    LED_0 = 0; */
    // </editor-fold>

    
    POS1CNTL = 0x8000;
    POS2CNTL = 0x8000;
    
    initAllPID(&pidSpeedLeft, &pidSpeedRight, &pidDistance, &pidAngle);
    initTimer();
    state = 1;
    
    stop = 0;

    int m,p = 0;
    p++;
    x = 1000;
    y = 1500;
    theta = PI;
    
    xc = x;
    yc = y;
    thetac = theta;
    
    xf = x;
    yf = y;
    tf = theta;
    for(p = 0; p <= 6; p++)
        servoUs(p,0);
    verbose = 0;
    while(1){
        //uint16_t dummy = SPI2BUF;
        sendLog("0x20 (debug) sent to ComeCard\n");
        SPI2BUF = 0x20; //debug
        delay_ms(500);
        //dummy = SPI2BUF;
        //CheckMessages();
        //sendLog(itoa(dummy));
        sendLog("0x21 (autre) sent to ComeCard\n");
        SPI2BUF = 0x21; //autre
        delay_ms(500);
        //dummy = SPI2BUF;
        CheckMessages();
        //sendLog(itoa(dummy));
    }
    while(1){
        /*for(p = 10; p < 50; p++){
            plot(p,100);
            delay_ms(10);
        }*/
        /*plot(1,(uint32_t)(int32_t)(thetac*1000));
        //plot(2,(uint32_t)(int32_t)(angularVelocity*1000));
        //plot(3,(uint32_t)(int32_t)(angle*1000));
        plot(4,(uint32_t)(int32_t)(theta*1000));
        plot(5,(uint32_t)(int32_t)(pidAngle.setPoint*1000));*/
        CheckMessages();
        //if(!stop){
            delay_ms(10);
            //plot(1,micros());
            sendPos();
            sendRupt();
            sendUS();
            /*plot(1,iF2);
            plot(2,iD2);*/
            m++;
            if(m >= 10){
                m = 0;
                //sendLog("m overflow\n");
            }
            //send("timing\n",strlen("timing\n"));
            if(newPosReceived){
                statePathGeneration = 42;
                delay_ms(100);
                newPosReceived = 0;
                if(newPosBackReceived)
                {
                    newPosBackReceived = 0;
                    //printRpi(("DEBUG goBack main 1\n"));
                    goBack(receivedX,receivedY,2000,200);
                    //printRpi(("DEBUG goBack main 2\n"));
                }
                else{
                    //go(receivedX,receivedY,2000,200);
                    //go(receivedX,receivedY,1000,100);
                    modif_straightPath(receivedX,receivedY,0,1000,100);
                }
            }
            if(newAngleReceived){
                newAngleReceived = 0;
                turn(receivedTheta);
            }
            /*if(statePathGeneration){
                plot(1,(uint32)(int32)(((thetac*3600)/(2*PI))));
                plot(2,(uint32)(int32)(((angularVelocity*3600)/(2*PI))));
                plot(3,(uint32)(int32)(((theta*3600)/(2*PI))));
            }*/
        //}
        
